# CoordinatePlaneVisibility Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePoint..::..CoordinatePlaneVisibility Property
ReferencePoint Class See Also
---
Visibility settings for the coordinate reference planes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CoordinatePlaneVisibility CoordinatePlaneVisibility { get; set; }
```

Visual Basic
---
```text
Public Property CoordinatePlaneVisibility As CoordinatePlaneVisibility
	Get
	Set
```

Visual C++
---
```text
public:
property CoordinatePlaneVisibility CoordinatePlaneVisibility {
	CoordinatePlaneVisibility get ();
	void set (CoordinatePlaneVisibility value);
}
```

# See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace